RequestWSDL.txt

<s:Envelope xmlns:s='http://schemas.xmlsoap.org/soap/envelope/'>
  <s:Body xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'>
    <AdaptPrice xmlns='urn:ccbb2:priceAdapter/1.0'>
      <configuration>
        <language>en-AU</language>
        <include mbvIset='VGA_ALL'/>
        <priceGroup>RRP</priceGroup>
        <priceType>1</priceType>
        <configuration modelVersion='1' modelYear='2019' model='' brand='76109' carline='70161'>
          <ecoLabel>
            <brandName xmlns='urn:ccbb2:types/2.6'/>
            <modelName xmlns='urn:ccbb2:types/2.6'/>
            <cubicCapacity xmlns='urn:ccbb2:types/2.6'/>
            <power xmlns='urn:ccbb2:types/2.6'/>
            <transmission xmlns='urn:ccbb2:types/2.6'/>
            <fuel xmlns='urn:ccbb2:types/2.6'/>
            <fuelConsumption xmlns='urn:ccbb2:types/2.6'>
              <combined/>
              <urban/>
              <extraUrban/>
            </fuelConsumption>
            <emissions xmlns='urn:ccbb2:types/2.6'>
              <combined/>
              <urban/>
              <extraUrban/>
            </emissions>
          </ecoLabel>
          <technicalDescriptions/>
          <attributes/>
        </configuration>
        <model modelYear='2019' version='1' key='SGH1B1\\GWH6WH6\\MHFE4HS'>
          <ecoLabel>
            <brandName xmlns='urn:ccbb2:types/2.6'/>
            <modelName xmlns='urn:ccbb2:types/2.6'/>
            <cubicCapacity xmlns='urn:ccbb2:types/2.6'/>
            <power xmlns='urn:ccbb2:types/2.6'/>
            <transmission xmlns='urn:ccbb2:types/2.6'/>
            <fuel xmlns='urn:ccbb2:types/2.6'/>
            <fuelConsumption xmlns='urn:ccbb2:types/2.6'>
              <combined/>
              <urban/>
              <extraUrban/>
            </fuelConsumption>
            <emissions xmlns='urn:ccbb2:types/2.6'>
              <combined/>
              <urban/>
              <extraUrban/>
            </emissions>
          </ecoLabel>
          <technicalDescriptions/>
          <attributes/>
        </model>
        <parameters>
          <parameter key='postcode' xmlns=''>2000</parameter>
        </parameters>
      </configuration>
      <price>
      <currency xmlns='urn:ccbb2:types/2.6'>AUD</currency>
      <configurationPrice xmlns="urn:ccbb2:types/2.6">43790.0</configurationPrice>
      <modelPrice key="SGH1B1\\GWH6WH6\\MHFE4HS" price="43790.0" priceValid="true" isWebApi="false" vatIncluded="false" version="1" modelYear="2019" xmlns="urn:ccbb2:types/2.6" />
      <configurationIsSpecialPrice xmlns="urn:ccbb2:types/2.6">false</configurationIsSpecialPrice>
      </price>
    </AdaptPrice>
  </s:Body>
</s:Envelope>
